<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"7b84abc642929708ee4fbeefa982422f8fe760fc25be6276390af56c017a9e86","plan_job_ref":"Job Test actions using target and replace #434 at https://github.com/dflook/terraform-github-actions/actions/runs/12445657251","plan_out_hash":"98c8a449e5ef6e8b0eebd7eaba608b300d282d42a8cedb0b98e507706274cbc2","plan_hash":"082eff9db5cc11c185bde3d8b927308d2380cd7c1b914c692f8fa2c39d97e41f","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "Inn6vH9lCp" -> (known after apply)
!~  foreach = "60oPzYCNL6" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #434](https://github.com/dflook/terraform-github-actions/actions/runs/12445657251)